--Types
Type_Signals = {[0] = "Выберите тип","Светофор","Знак","Автоведение (ПАМ)","Автостоп","КГУ"}
Type_Signal = {
    {"Тоннельный",			1},
    {"Мачтовый",			2},
    {"Уличный",				3},
    {"Карликовый",			4},
    {"Невидимый",			5},
    {"Тоннельный новый",	6},
    {"Карликовый СПБ",		7}
}
Type_Signal_Route = {[0] = "Выберите тип","Автоматический", "Ручной","Повторитель","Резервный"}
Type_PAM = {
	[0] = "Выберите тип","Команды (доска)","Тормоз для станции (Доска)", "Команда открытия дверей",
    "Светоотраж. метка ПА","ПА-метка","УППС сенсор","СБПП сенсор"
}
Type_Autostops = {[0] = "Выберите тип","Выносной", "Инерционный", "Статичный", "Инерционный одностороннего действия"}
Type_Signs = {
	[0] = "Выберите тип",
	"Скоростные ограничения",
	"ОПВ",
	"Знаки ограждений",
	"Служебные",
	"Режимы стандартные",
	"Режимы новые",
	"Знаки остановок"
}
Type_Signs_Speed = {
    {"НЧ (ОЧ)",			0},
    {"10 км/ч",			60},
    {"35 км/ч",			33},
    {"40 км/ч",			1},
    {"50 км/ч",			44},
    {"60 км/ч",			2},
    {"70 км/ч",			3},
    {"80 км/ч",			4},
    {"Уличный НЧ(ОЧ)",	26},
	{"Уличный 35 км/ч",	27},
	{"Уличный 40 км/ч",	28},
	{"Уличный 50 км/ч",	45},
	{"Уличный 60 км/ч",	29},
	{"Уличный 70 км/ч",	30},
	{"Уличный 80 км/ч",	31},
	{"Х25/40 км/ч",		61},
	{"Х35/60 км/ч",		62},
	{"Х40/70 км/ч",		63},
	{"АЛС-0",			47},
	{"АЛС-НЧ",			48}
}
Type_Signs_OPV = {
    {"ОПВ (светящийся)",10},
    {"ОПВ",				66},
    {"ОПВ на 3 вагона",	67},
    {"ОПВ на 4 вагона",	68},
    {"ОПВ на 5 вагонов",69},
    {"ОПВ на 6 вагонов",70},
    {"ОПВ внизу",		71}
}
Type_Signs_Opasno = {
    {"Опасно",				8},
    {"Предел ЭТ",			12},
    {"ЭТ начало",			19},
    {"Ограждение сходного устройства",20},
    {"Опасно 200 м",		34},
    {"Уличный ЭТ предел",	42},
    {"Металлоконструкция",	43}
}
Type_Signs_Service = {
    {"Граница станции",		5},
    {"С (Тифон)",			18},
    {"Уличный С (Тифон)",	6},
    {"Правые двери",		21},
    {"Телефон ▲",			22},
    {"Телефон ▼",			23},
    {"013 конец",			49},
    {"334 конец",			50},
    {"КР конец",			35},
	{"КР конец (инверт.)",	36}
}
Type_Signs_TED = {
    {"ТЭД вкл.",		17},
    {"ТЭД выкл.",		16},
    {"Т начало",		13},
    {"Т конец",			14},
    {"Т сбор",			15},
    {"Уличный Т сбор",	32},
    {"Ход-2",			46},
    {"Ход-2 уличный",	51},
    {"Т1",				53},
    {"Т исп",			64},
	{"Т исп 100м",		65}
}
Type_Signs_TED_new = {
	{"ТЭД выкл. нагон",				211},
	{"ТЭД выкл.",					213},
	{"ТЭД выкл. 2 черных полосы (2)",214},
	{"ТЭД выкл. нагон мелкий",		215},
	{"ТЭД выкл. 2 черных полосы",	216},
	{"ТЭД выкл. 1 красная полоса",	217},
	{"ТЭД выкл. 1 синия полоса",	218},
	{"ТЭД выкл. 4 синих полосы",	219},
	{"ТЭД вкл. 10%",				220},
	{"ТЭД вкл. 20%",				221},
	{"ТЭД вкл. 30%",				222},
	{"ТЭД вкл. 40%",				223},
	{"ТЭД вкл. 50%",				224},
	{"ТЭД вкл. 60%",				225},
	{"ТЭД вкл. 70%",				226},
	{"ТЭД вкл. 80%",				227},
	{"ТЭД вкл. 90%",				228},
	{"ТЭД вкл. 100%",				229},
	{"ТЭД вкл. нагон",				230},
	{"ТЭД вкл.",					232},
	{"ТЭД вкл. 2 черных полосы",	233},
	{"ТЭД вкл. нагон мелкий",		234},
	{"ТЭД вкл. 2 черных полосы (2)",235},
	{"ТЭД вкл. 1 красная полоса",	236},
	{"ТЭД вкл. 1 синия полоса",		237},
	{"ТЭД вкл. 4 синих полосы",		238},
}
Type_Signs_Stop = {
    {"УП1",				24},
    {"УП2",				37},
    {"УП3",				38},
    {"УП4",				39},
    {"УП5",				40},
    {"УП6",				41},
    {"3",				52},
    {"4",				54},
    {"5",				55},
	{"6",				56},
	{"Уличный 5",		57},
	{"Уличный 6",		58},
	{"СТОП (!)",		11},
	{"Уличный СТОП",	7},
	{"Уличный СТОП!!!",	25},
	{"Отстой (ночной)",	9},
	{"15м",	241}
}
Type_Signs_Choice = {
    [1] = Type_Signs_Speed,
    [2] = Type_Signs_OPV,
    [3] = Type_Signs_Opasno,
    [4] = Type_Signs_Service,
    [5] = Type_Signs_TED,
    [6] = Type_Signs_TED_new,
    [7] = Type_Signs_Stop,
}